Revit 2027 API
ExportPDFSettings.ListNames Method
 Returns all the names of the settings instances in the document.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static IList<string> ListNames(
	Document document
)
Public Shared Function ListNames (
	document As Document
) As IList(Of String)
public:
static IList<String^>^ ListNames(
	Document^ document
)
static member ListNames :
        document : Document -> IList<string>
Parameters
document Document
 Document where the settings to be found.
Return Value
IList<String>
 List of names.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
ExportPDFSettings Class
Autodesk.Revit.DB Namespace